/*
02_Parameters
    功能
        学习形式参数，实际参数
    目的
        1 了解参数的类型
        2 会用参数
        3 灵活运用函数
*/
#include <stdio.h>

int f(int n);

int main(void)
{
    f(4); // 调用f(4)函数，4为实际参数
    
    return 0;
}

int f(int n) // 建立int型形式参数
{
    if (n)
    {
        printf("f(%d - 1) + %d\n", n, n);

        return f(n - 1) + n; // 返回递归数列
    }

    else
    {
        printf("%d\n", n);

        return n;
    }
}

/*输出结果
----------------------------------------------------------------------------------------------------
f(4 - 1) + 4
f(3 - 1) + 3
f(2 - 1) + 2
f(1 - 1) + 1
0
----------------------------------------------------------------------------------------------------
*/

// 2021年2月26号17点49分