/*
02-Operator+
    功能
        看++x,x++的区别,验证逗号表达式的运算逻辑
    目的
        1 学习++x,x++
        2 学习逗号表达式
*/

#include <stdio.h>
#include <windows.h>

int main(void)
{
    /*
    x++表示x自增1后再参与其它运算
    ++x是x参与运算后,x的值再自增1
    x--
    --x同理
    */
    int a;
    int b = 5;
    a = b++; // b++现在是后自增,参与运算是5赋给了a,b再变为6
    printf("a = %d, b = %d\n", a, b);

    int c;
    int d = 10;
    c = ++d; // ++d现在是先自增,参与运算是11赋给了c,d先变为11
    printf("c = %d, d = %d\n", c, d);
    
    /*
    (表达式1,表达式2,表达式3,...... ,表达式n)
    逗号表达式的要领:
        1 逗号表达式的运算过程为：从左往右逐个计算表达式
        2 逗号表达式作为一个整体,它的值为最后一个表达式(也即表达式n)的值
        3 逗号运算符的优先级别在所有运算符中最低
    */
    int x,y,z;
    x=1;
    y=1;
    z=x++,y++,++y; // 这里赋值运算符优先级14，逗号运算符优先级15，所以先赋值，z = 1
    printf("x = %d, y = %d, z = %d\n",x,y,z);

    system("pause");

    return 0;
}

/*输出结果
----------------------------------------------------------------------------------------------------
a = 5, b = 6
c = 11, d = 11
x = 2, y = 3, z = 1
----------------------------------------------------------------------------------------------------
*/

// 2021年2月18号17点06分