/*
02_Sorting_Algorithm
    功能
        输入10个大小在0~1000的数字，从小到大输出行成直角三角形
    目的
        1 学习for和if和printf和scanf和数组
        2 复习
*/

#include <stdio.h>

int main(void)
{
    int a[10];
    int i;
    int j;

    for (i = 0; i < 10; i++)
    {
        scanf("%d", &a[i]);
    }

    for (i = 0; i < 10; i++) // i的扫描
    {
        int min = i;                 // 初始化min为i，默认最小
        for (j = i + 1; j < 10; j++) // j的扫描，访问未知排序
        {
            if (a[j] < a[min]) // 如a j与a min比，小，则赋给min
            {
                min = j;
            }
        }
        if (min != i) // 如a min与a i不等，则排a min到a i的位置上,就是交换
        {
            int t;
            t = a[min];
            a[min] = a[i];
            a[i] = t;
        }
    }
    for (i = 0; i < 10; i++)
    {
        for (j = 0; j < i + 1; j++)
        {
            printf("%d ", a[i]);
        }
        printf("\n");
    }
    return 0;
}

/*输出结果
----------------------------------------------------------------------------------------------------
4
4 4
11 11 11
22 22 22 22
33 33 33 33 33
65 65 65 65 65 65
123 123 123 123 123 123 123
215 215 215 215 215 215 215 215
654 654 654 654 654 654 654 654 654
852 852 852 852 852 852 852 852 852 852
----------------------------------------------------------------------------------------------------
*/

// 2021年3月2号3点01分