/*
02-Equatlon-Of-Two-Degree-Plus
    功能：
        用户赋给abc三个值，计算一元二次方程
    目的：
        1 记住BODH，知道整数 小数 字符型等基本类型书写，;知道计算机的科学计数法
        2 了解并会用scanf("", )
        3 知道&取址符
*/
#include <math.h>
#include <stdio.h> // 含【scanf("") -- 向标准输入设备读取字符串】的头文件 -- 标准输入输出
#include <windows.h>

int main(void)
{   /*
    基本类型书写
        整数
            默认为10进制 ,10 ，20
            以0开头为8进制,045，021
            以0b开头为2进制,0b11101101
            以0x开头为16进制,0x21458adf
        小数
            单精度常量:2.3f
            双精度常量:2.3 -- 默认为双精度
        字符型常量
            用英文单引号括起来,只保存一个字符'a'、'b' 、'*' ,还有转义字符 '\n' 、'\t'
        字符串常量
            用英文的双引号引起来 可以保存多个字符"abc"
    
    科学计数法
        1.03乘10的9次方   --   1.03E+09   --   1.03e09 -- 1.03e+9
        1.03乘10的-9次方  --   1.03E-09   --   1.03e-9
    */
    double a;
    double b;
    double c;
    double delta;
    double X1;
    double X2;

    printf("a = ?\n");
    scanf("%lf", &a); // scanf("输入控制符"，输入参数) -- 输入字符转为输入控制符类型数据，然后赋给输入参数的地址的变量中
    printf("b = ?\n");
    scanf("%lf", &b); // & -- 取址符
    printf("c = ?\n");
    scanf("%lf", &c); // scanf("非输入控制符+输入控制符"，输入参数) -- 必须原样输入非输入控制符+输入字符才正确
    // scanf("%f,%f,%f\n", a, b, c) -- 要加逗号；scanf("%f %f %f\n", a, b, c) -- 要加空格
    delta = b * b - 4 * a * c;

    if (delta > 0)
    {
        X1 = (-b + sqrt(delta)) / (2 * a);
        X2 = (-b - sqrt(delta)) / (2 * a);
        printf("X1 = %lf,X2 = %lf\n", X1, X2);
        system("pause");
    }
    else if (delta == 0)
    {
        X1 = -b / (2 * a);
        printf("X1 = X2 = %lf\n", X1);
        system("pause");
    }
    else
    {
        printf("无解\n");
        system("pause");
    }

    return 0;
}

/* 输出结果：
----------------------------------------------------------------------------------------------------
a = ?
1
b = ?
5
c = ?
6
X1 = -2.000000,X2 = -3.000000
----------------------------------------------------------------------------------------------------
*/

// 2021年1月13号13点06分